
can override scalar vector error message for base scalar types
==============================================================

> vec_ptype2(NULL, quote(x), y_arg = "foo")
Error: `foo` must be a vector, not a symbol.

> vec_ptype2(quote(x), NULL, x_arg = "foo")
Error: `foo` must be a vector, not a symbol.


can override scalar vector error message for S3 types
=====================================================

> vec_ptype2(NULL, foobar(), y_arg = "foo")
Error: `foo` must be a vector, not a `vctrs_foobar` object.

> vec_ptype2(foobar(), NULL, x_arg = "foo")
Error: `foo` must be a vector, not a `vctrs_foobar` object.


ptype2 and cast errors when same class fallback is impossible are informative
=============================================================================

> vec_cast(foobar(1, bar = TRUE), foobar(2, baz = TRUE))
Error: Can't convert <vctrs_foobar> to <vctrs_foobar>.

> vec_ptype2(foobar(1, bar = TRUE), foobar(2, baz = TRUE))
Error: Can't combine <vctrs_foobar> and <vctrs_foobar>.

